# SetHostPointReference Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointRelativeToPoint..::..SetHostPointReference Method
PointRelativeToPoint Class See Also
---
Change the host point reference.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetHostPointReference(
	Reference hostPointReference
)
```

Visual Basic
---
```text
Public Sub SetHostPointReference ( _
	hostPointReference As Reference _
)
```

Visual C++
---
```text
public:
void SetHostPointReference(
	Reference^ hostPointReference
)
```

# ### Parameters
hostPointReference
    Type: Autodesk.Revit.DB..::..Reference
# Remarks
Allowed references are to another Autodesk.Revit.DB.ReferencePoint element or to an Autodesk.Revit.DB.Point.
# See Also
PointRelativeToPoint Class
Autodesk.Revit.DB Namespace